app/controllers/educations_controller.rb

INSERT INTO "educations" ("degree", "school", "description", "start", "end", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["degree", nil], ["school", nil], ["description", nil], ["start", nil], ["end", nil], ["profile_id", 1], ["created_at", "2022-02-05 10:42:04.181830"], ["updated_at", "2022-02-05 10:42:04.181830"]]
---
    def new
        current_user.profile.educations.create